Revit 2026 API

# PropertySelectionType Enumeration

---

An enumerated type listing the types of properties to find in the template.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum PropertySelectionType
```
```vb
Public Enumeration PropertySelectionType
```
```cpp
public enum class PropertySelectionType
```
```fsharp
type PropertySelectionType
```

| Member name | Value | Description |
| --- | --- | --- |
| All | 0 | All the properties. |
| Exporting | 1 | The properties that are included in export. |
| NonExporting | 2 | The properties that are not included in export. |

#### Reference

Autodesk.Revit.DB Namespace